content-org/posts.org
#+TITLE: Samarth's Blog
#+HUGO_BASE_DIR: ../
#+OPTIONS:  ^:nil
#+HUGO_SECTION: posts/
#+HUGO_AUTO_SET_LASTMOD: t
#+DATE: 2020-06-29
#+STARTUP: logdone

* DONE Typed APIs in Python with dataclasses and NamedTuples :programming:python:
CLOSED: [2020-08-13 Thu 13:35]
:PROPERTIES:
:EXPORT_FILE_NAME: typed_apis_in_python
:END:

Why would Python programmers ever care about types? While Python doesn't check any types statically (before running the program), it does perform extensive run-time type checking. Checking types at run-time without any implicit casts makes the language strongly-typed and dynamically-typed, as opposed to a language like C which is weakly-typed and statically-typed. This is an important distinction, but I won't go over the differences between strong and weak typing in this post.

Newer versions of Python 3 have support for type annotations which gives the programmer some more information about types. Tools like =mypy= perform some basic static type checking. However, these static type-checkers are not all-powerful and sometimes it's useful to provide some extra type-safety dynamically at run-time.

** The API

Imagine you're writing a Python script that uses a stock market API. The API provides a GET method called =get_stocks= which returns some JSON data containing information about three very specific stocks you're interested in (this is important because we know exactly what data the API method will return and therefore can model it). This is a bit hand-wavy, but the actual API call doesn't matter---we only care about the JSON return value.

#+begin_src python :session stock-session :results output :exports both
import json
from pprint import pprint

def get_stocks() -> str:
    """
    API method returning some JSON data
    """

    return json.dumps(
        {
            "TSLA": {"price": "1000.00"},
            "AMZN": {"price": "3000.00"},
            "AAPL": {"price": "400.00"}
        }
    )


stock_data = get_stocks()
pprint(stock_data)
#+end_src

#+results:
: ('{"TSLA": {"price": "1000.00"}, "AMZN": {"price": "3000.00"}, "AAPL": '
:  '{"price": "400.00"}}')


We'd usually consume this API by serializing the JSON string to a Python =dict=.

#+begin_src python :session stock-session :results output :exports both
def get_tsla_price(stock_json_data: str) -> float:
    return float(json.loads(stock_json_data)["TSLA"]["price"])

print(get_tsla_price(stock_data))
#+end_src

#+results:
: 1000.0


This is alright, but remembering that the =price= field is a string can get tedious. Let's try and do better by defining the type of this JSON structure.

#+begin_src python :session stock-session :results output :exports both
from typing import Dict

def stocks_to_dict(stock_json_data: str) -> Dict[str, Dict[str, float]]:
    return json.loads(stock_json_data)

pprint(stocks_to_dict(stock_data))
#+end_src

#+results:
: {'AAPL': {'price': '400.00'},
:  'AMZN': {'price': '3000.00'},
:  'TSLA': {'price': '1000.00'}}


Now a static type-checker like =mypy= can assume that =stock_data["TSLA"]["price"]= is a =float=.

What if the API changes, and the =get_stocks= method also includes the company name and the percent change (I'm not a stock market expert so this might not be the correct term) in each stock JSON object?

#+begin_src python :session stock-session :results output :exports both
def get_stocks() -> str:
    """
    API method returning some JSON data
    """

    return json.dumps(
        {
            "TSLA": {
                "name": "Tesla, Inc.",
                "price": "1000.00",
                "percent_change": "+2.03%"
            },
            "AMZN": {
                "name": "Amazon.com, Inc.",
                "price": "3000.00",
                "percent_change": "-1.01%"
            },
            "AAPL": {
                "name": "Apple Inc.",
                "price": "400.00",
                "percent_change": "-1.51%"
            }
        }
    )

stock_data = get_stocks()

pprint(stock_data)
#+end_src

#+results:
: ('{"TSLA": {"name": "Tesla, Inc.", "price": "1000.00", "percent_change": '
:  '"+2.03%"}, "AMZN": {"name": "Amazon.com, Inc.", "price": "3000.00", '
:  '"percent_change": "-1.01%"}, "AAPL": {"name": "Apple Inc.", "price": '
:  '"400.00", "percent_change": "-1.51%"}}')


What does the type signature for the serialized =dict= even look like? We wouldn't want to keep the percent change as a string because that would be painful to work with.

This is my best guess but it's still not great.

#+begin_src python :session stock-session :results output :exports both
from typing import Dict, Union


def stocks_to_dict(stock_json_data: str) -> Dict[str, Dict[str, Union[float, str]]]:
    return json.loads(stock_json_data)


pprint(stocks_to_dict(stock_data))
#+end_src

#+results:
: {'AAPL': {'name': 'Apple Inc.', 'percent_change': '-1.51%', 'price': '400.00'},
:  'AMZN': {'name': 'Amazon.com, Inc.',
:           'percent_change': '-1.01%',
:           'price': '3000.00'},
:  'TSLA': {'name': 'Tesla, Inc.',
:           'percent_change': '+2.03%',
:           'price': '1000.00'}}


Most static typecheckers for Python will not complain that this =dict= still doesn't reflect the type of the function. Let's add some type conversions:

#+begin_src python :session stock-session :results output :exports both
from typing import Dict, Union


def stocks_to_dict(stock_json_data: str) -> Dict[str, Dict[str, Union[float, str]]]:
    stocks_dict = json.loads(stock_json_data)
    for symbol in stocks_dict.keys():
        stocks_dict[symbol]["price"] = float(stocks_dict[symbol]["price"])
    return stocks_dict


stocks_dict = stocks_to_dict(stock_data)
pprint(stocks_dict)
print(isinstance(stocks_dict["TSLA"]["price"], float))
#+end_src

#+results:
: {'AAPL': {'name': 'Apple Inc.', 'percent_change': '-1.51%', 'price': 400.0},
:  'AMZN': {'name': 'Amazon.com, Inc.',
:           'percent_change': '-1.01%',
:           'price': 3000.0},
:  'TSLA': {'name': 'Tesla, Inc.', 'percent_change': '+2.03%', 'price': 1000.0}}
: True

