content-org/posts.org
** Dynamically adding types

This works, but I'm lazy and don't want to write a specialized =x_to_dict= function for every single API method. I want something like a dynamically type-safe C =struct=---a data-structure that automatically serializes a =dict= with the correct type conversions. Another benefit of this =struct= is that it provides some basic documentation for what kinds of fields the API returns and their types. Dictionaries are still great and definitely have their place in Python programs, but in my opinion, an object called =Stocks= is a lot more descriptive and amenable to refactoring than =Dict[str, Dict[str, Union[float, str]]]=.

Here's an example of some of the functionality that I want:

#+begin_src python
stocks = Stocks(**json.loads(stock_data))
print(stocks.TSLA)  # -> nice representation of the object
print(stocks.TSLA.price)  # -> 1000.0
print(stocks.TSLA.percent_change)  # -> 0.0203
print(stocks.AMZN.percent_change)  # -> -0.0101
print(stocks.AAPL.name)  # -> "Apple Inc."
#+end_src

#+RESULTS:

Notice how the =price= and =percent_change= attributes will automatically get converted to =floats=.

Let's take a stab at implementing this with a regular class:

#+begin_src python :session stock-session :results output :exports both
def percent_to_float(percent: str) -> float:
    """
    Converts a percentage string to a float.

    e.g. percent_to_float("+1.01%") -> 0.0101
    e.g. percent_to_float("-22.22%") -> -0.2222
    """

    neg = -1 if percent[0] == "-" else 1
    return neg * float(percent[1:-1]) / 100


class Stocks:
   def __init__(self, *args, **kwargs):
       for symbol, info in kwargs.items():
           # e.g. sets self.TSLA to an empty object
           setattr(self, symbol, type("", (), {})())
           # e.g. sets self.TSLA.name to "Tesla, Inc."
           setattr(getattr(self, symbol), "name", info["name"])
           # e.g. sets self.TSLA.price to 1000.0
           setattr(getattr(self, symbol), "price", float(info["price"]))
           # # e.g. sets self.AMZN.percent_change to -0.0101
           setattr(getattr(self, symbol), "percent_change",
                   percent_to_float(info["percent_change"]))


stocks = Stocks(**json.loads(stock_data))
print(stocks.TSLA)  # -> nice representation of the object
print(stocks.TSLA.price)  # -> 1000.0
print(stocks.TSLA.percent_change)  # -> 0.0203
print(stocks.AMZN.percent_change)  # -> -0.0101
print(stocks.AAPL.name)  # -> "Apple Inc."
#+end_src

#+results:
: <__main__. object at 0x10ddcc5d0>
: 1000.0
: 0.0203
: -0.0101
: Apple Inc.


This works pretty well! We've used simple metaprogramming to dynamically create class attributes at run-time, all with the correct types! The only problem is that we'd have to add a =__repr__= method to each dynamically-created object to get a nice representation of =stocks.TSLA= when printed. Remember, I'm lazy so this is clearly too much work.

** Type-safety with dataclasses

Remember that this is Python and there's usually a simple answer to most problems in the standard library. Turns out that =NamedTuples= and =dataclasses= both do the trick.

#+begin_src python :session stock-session :results output :exports both
from dataclasses import dataclass


@dataclass
class StockInfo:
    name: str
    price: float
    percent_change: float

    def __post_init__(self):
        self.price = float(self.price)
        self.percent_change = percent_to_float(self.percent_change)


print(StockInfo(**json.loads(stock_data)["TSLA"]))
#+end_src

#+results:
: StockInfo(name='Tesla, Inc.', price=1000.0, percent_change=0.0203)


That was easy! Now we can simplify the =Stock= class to use these =StockInfo= objects.

#+begin_src python :session stock-session :results output :exports both
class Stocks:
   def __init__(self, *args, **kwargs):
       for symbol, info in kwargs.items():
           # e.g. sets self.TSLA to StockInfo object
           setattr(self, symbol, StockInfo(**info))


stocks = Stocks(**json.loads(stock_data))
print(stocks.TSLA)  # -> nice representation of the object
print(stocks.TSLA.price)  # -> 1000.0
print(stocks.TSLA.percent_change)  # -> 0.0203
print(stocks.AMZN.percent_change)  # -> -0.0101
print(stocks.AAPL.name)  # -> "Apple Inc."
#+end_src

#+results:
: StockInfo(name='Tesla, Inc.', price=1000.0, percent_change=0.0203)
: 1000.0
: 0.0203
: -0.0101
: Apple Inc.


As an added bonus, printing out =stocks.TSLA= gives us a nice representation of the =StockInfo= object, where before it would print out the raw Python object which isn't that helpful (of course, it's easy enough to add a =__repr__= method but that's too much work).

What happens if we try and update the stock?

#+begin_src python :session stock-session :results output :exports both
stocks.TSLA.name = "SpaceX, Inc."
print(stocks.TSLA)
#+end_src

#+results:
: StockInfo(name='SpaceX, Inc.', price=1000.0, percent_change=0.0203)


This isn't good. I want these objects to be immutable which will prevent a whole class of potential errors.

Turns out that =dataclasses= can be immutable with a quick modification to the decorator. That should do the trick?

#+begin_src python :session stock-session :results output :exports both
@dataclass(frozen=True)
class StockInfo:
    name: str
    price: float
    percent_change: float

    def __post_init__(self):
        self.price = float(self.price)
        self.percent_change = percent_to_float(self.percent_change)


print(StockInfo(**json.loads(stock_data)["TSLA"]))
#+end_src

#+results:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-Jeqvjt/python-DECY0g", line 12, in <module>
:     print(StockInfo(**json.loads(stock_data)["TSLA"]))
:   File "<string>", line 6, in __init__
:   File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-Jeqvjt/python-DECY0g", line 8, in __post_init__
:     self.price = float(self.price)
:   File "<string>", line 4, in __setattr__
: dataclasses.FrozenInstanceError: cannot assign to field 'price'


Looks like the frozen property gets enforced immediately after the =dataclass= gets initialized, so there's no way to change the class instance variables after they're set.

There's a workaround where you can use =super().__setattr__= to bypass the restrictions on calling =setattr= directly because of the =frozen= property. [[https://stackoverflow.com/a/54119384/7432268][(relevant StackOverflow post)]]

#+begin_src python :session stock-session :results output :exports both
@dataclass(frozen=True)
class StockInfo:
    name: str
    price: float
    percent_change: float

    def __post_init__(self):
        super().__setattr__("price", float(self.price))
        super().__setattr__("percent_change", percent_to_float(self.percent_change))


stocks = Stocks(**json.loads(stock_data))
print(stocks.TSLA)

stocks.TSLA.name = "SpaceX, Inc."  # raises an error
#+end_src

#+results:
: StockInfo(name='Tesla, Inc.', price=1000.0, percent_change=0.0203)
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-Jeqvjt/python-wfC3n6", line 15, in <module>
:     stocks.TSLA.name = "SpaceX, Inc."  # raises an error
:   File "<string>", line 4, in __setattr__
: dataclasses.FrozenInstanceError: cannot assign to field 'name'

#+begin_src python :session stock-session :exports none
DCStockInfo = StockInfo
#+end_src

#+RESULTS:
: None

Looks like this is working properly.

