content-org/posts.org
** Type-safety with NamedTuples

If you don't want to use =dataclasses=, a =NamedTuple= works just as well. =NamedTuples= are immutable by default. We want to do the type conversions before the object is actually initialized using =__new__= because once the =NamedTuple= is created, it's immutable.

#+begin_src python :session stock-session :results output :exports both
from typing import NamedTuple


class StockInfo(NamedTuple):
    name: str
    price: float
    percent_change: float

    def __new__(cls, *args, **kwargs):
        kwargs["price"] = float(kwargs["price"])
        kwargs["percent_change"] = percent_to_float(kwargs["percent_change"])
        return super().__new__(cls, *args, **kwargs)


print(StockInfo(**json.loads(stock_data)["TSLA"]))
#+end_src

#+results:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-Jeqvjt/python-Gv1AH2", line 3, in <module>
:     class StockInfo(NamedTuple):
:   File "/usr/local/Cellar/python/3.7.7/Frameworks/Python.framework/Versions/3.7/lib/python3.7/typing.py", line 1386, in __new__
:     raise AttributeError("Cannot overwrite NamedTuple attribute " + key)
: AttributeError: Cannot overwrite NamedTuple attribute __new__


Turns out we can't modify the =__new__= method directly to convert the types, but it's possible to hack around this via sub-classing.

#+begin_src python :session stock-session :results output :exports both
from typing import NamedTuple


class _BaseStockInfo(NamedTuple):
    name: str
    price: float
    percent_change: float


class StockInfo(_BaseStockInfo):
    def __new__(cls, *args, **kwargs):
        kwargs["price"] = float(kwargs["price"])
        kwargs["percent_change"] = percent_to_float(kwargs["percent_change"])
        return super().__new__(cls, *args, **kwargs)


stocks = Stocks(**json.loads(stock_data))
print(stocks.TSLA)
stocks.TSLA.name = "SpaceX, Inc."  # raises an error
#+end_src

#+results:
: StockInfo(name='Tesla, Inc.', price=1000.0, percent_change=0.0203)
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-Jeqvjt/python-CHqjcX", line 18, in <module>
:     stocks.TSLA.name = "SpaceX, Inc."  # raises an error
: AttributeError: can't set attribute

Looks like it's working properly.

Let's just do a quick check to make sure everything works:

#+begin_src python :session stock-session :results output :exports both
stocks = Stocks(**json.loads(stock_data))
print(stocks.TSLA.price)  # -> 1000.0
print(stocks.TSLA.percent_change)  # -> 0.0203
print(stocks.AMZN.percent_change)  # -> -0.0101
print(stocks.AAPL.name)  # -> "Apple Inc."
#+end_src

#+results:
: 1000.0
: 0.0203
: -0.0101
: Apple Inc.

#+begin_src python :session stock-session :exports none
NTStockInfo = StockInfo
#+end_src

#+RESULTS:
: None

Now we have a nice strongly-typed wrapper object for our previously stringly-typed JSON data!

** Dataclass vs NamedTuple

*** Unpacking

What if we want to unpack the =StockInfo= object for multiple-assignment?

This is easy with =NamedTuples= since they work just like regular tuples.

#+begin_src python :session stock-session :results output :exports both
tsla = NTStockInfo(**json.loads(stock_data)["TSLA"])
print("TSLA values: ", *tsla, sep=" | ")
name, _, percent_change = tsla
print(f"percent change for {name} stock is {percent_change}")
#+END_SRC

#+RESULTS:
: TSLA values:  | Tesla, Inc. | 1000.0 | 0.0203
: percent change for Tesla, Inc. stock is 0.0203

The same can't be said for a =dataclass=.

#+begin_src python :session stock-session :results output :exports both
tsla = DCStockInfo(**json.loads(stock_data)["TSLA"])
name, _, percent_change = tsla
print(f"percent change for {name} stock is {percent_change}")
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
:   File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-Jeqvjt/python-dlN3nO", line 2, in <module>
:     name, _, percent_change = tsla
: TypeError: cannot unpack non-iterable StockInfo object

We can work around this by using the =dataclasses.astuple= function, but it's not as intuitive.

#+begin_src python :session stock-session :results output :exports both
import dataclasses

tsla = DCStockInfo(**json.loads(stock_data)["TSLA"])
print("TSLA values: ", *dataclasses.astuple(tsla), sep=" | ")
name, _, percent_change = dataclasses.astuple(tsla)
print(f"percent change for {name} stock is {percent_change}")
#+END_SRC

#+RESULTS:
: TSLA values:  | Tesla, Inc. | 1000.0 | 0.0203
: percent change for Tesla, Inc. stock is 0.0203

*** Serializing to JSON

Since we're dealing with APIs, it's useful to quickly be able to serialize an object to JSON with the correct types.

#+begin_src python :session stock-session :results output :exports both
tsla = NTStockInfo(**json.loads(stock_data)["TSLA"])

# the _asdict() method converts a NamedTuple to a mapping type
pprint(json.dumps(tsla._asdict()))
#+END_SRC

#+RESULTS:
: '{"name": "Tesla, Inc.", "price": 1000.0, "percent_change": 0.0203}'

#+begin_src python :session stock-session :results output :exports both
import dataclasses

tsla = DCStockInfo(**json.loads(stock_data)["TSLA"])
pprint(json.dumps(dataclasses.asdict(tsla)))
#+END_SRC

#+RESULTS:
: '{"name": "Tesla, Inc.", "price": 1000.0, "percent_change": 0.0203}'

Both approaches work equally well in this case.

*** Documentation

The =dataclass= implementation is, in my opinion, simpler to implement and has nicer built-in documentation via =help(StockInfo)=.

#+BEGIN_SRC
Help on class StockInfo in module __main__:

class StockInfo(builtins.object)
 |  StockInfo(name: str, price: float, percent_change: float) -> None
#+END_SRC

Since our =NamedTuple= implementation is a sub-class, we have to scroll down a bit to find the attributes of the class in the =help= output, and the type annotations are hidden away as an =OrderedDict= in the =_fields= attribute.

#+BEGIN_SRC
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _BaseStockInfo:
 |
 |  name
 |      Alias for field number 0
 |
 |  price
 |      Alias for field number 1
 |
 |  percent_change
 |      Alias for field number 2
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _BaseStockInfo:
 |
 |  __annotations__ = OrderedDict([('name', <class 'str'>), ('price', ... ...
 |
 |  _field_defaults = {}
 |
 |  _field_types = OrderedDict([('name', <class 'str'>),
#+END_SRC



