content/posts/typed_apis_in_python.md

## Type-safety with NamedTuples {#type-safety-with-namedtuples}

If you don't want to use `dataclasses`, a `NamedTuple` works just as well. `NamedTuples` are immutable by default. We want to do the type conversions before the object is actually initialized using `__new__` because once the `NamedTuple` is created, it's immutable.

```python
from typing import NamedTuple


class StockInfo(NamedTuple):
    name: str
    price: float
    percent_change: float

    def __new__(cls, *args, **kwargs):
        kwargs["price"] = float(kwargs["price"])
        kwargs["percent_change"] = percent_to_float(kwargs["percent_change"])
        return super().__new__(cls, *args, **kwargs)


print(StockInfo(**json.loads(stock_data)["TSLA"]))
```

```text
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
  File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-g6I1LO/python-lQpgrh", line 4, in <module>
    class StockInfo(NamedTuple):
  File "/usr/local/Cellar/python@3.8/3.8.5/Frameworks/Python.framework/Versions/3.8/lib/python3.8/typing.py", line 1638, in __new__
    raise AttributeError("Cannot overwrite NamedTuple attribute " + key)
AttributeError: Cannot overwrite NamedTuple attribute __new__
```

Turns out we can't modify the `__new__` method directly to convert the types, but it's possible to hack around this via sub-classing.

```python
from typing import NamedTuple


class _BaseStockInfo(NamedTuple):
    name: str
    price: float
    percent_change: float


class StockInfo(_BaseStockInfo):
    def __new__(cls, *args, **kwargs):
        kwargs["price"] = float(kwargs["price"])
        kwargs["percent_change"] = percent_to_float(kwargs["percent_change"])
        return super().__new__(cls, *args, **kwargs)


stocks = Stocks(**json.loads(stock_data))
print(stocks.TSLA)
stocks.TSLA.name = "SpaceX, Inc."  # raises an error
```

```text
StockInfo(name='Tesla, Inc.', price=1000.0, percent_change=0.0203)
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
  File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-g6I1LO/python-ayaPng", line 19, in <module>
    stocks.TSLA.name = "SpaceX, Inc."  # raises an error
AttributeError: can't set attribute
```

Looks like it's working properly.

Let's just do a quick check to make sure everything works:

```python
stocks = Stocks(**json.loads(stock_data))
print(stocks.TSLA.price)  # -> 1000.0
print(stocks.TSLA.percent_change)  # -> 0.0203
print(stocks.AMZN.percent_change)  # -> -0.0101
print(stocks.AAPL.name)  # -> "Apple Inc."
```

```text
1000.0
0.0203
-0.0101
Apple Inc.
```

Now we have a nice strongly-typed wrapper object for our previously stringly-typed JSON data!

## Dataclass vs NamedTuple {#dataclass-vs-namedtuple}

### Unpacking {#unpacking}

What if we want to unpack the `StockInfo` object for multiple-assignment?

This is easy with `NamedTuples` since they work just like regular tuples.

```python
tsla = NTStockInfo(**json.loads(stock_data)["TSLA"])
print("TSLA values: ", *tsla, sep=" | ")
name, _, percent_change = tsla
print(f"percent change for {name} stock is {percent_change}")
```

```text
TSLA values:  | Tesla, Inc. | 1000.0 | 0.0203
percent change for Tesla, Inc. stock is 0.0203
```

The same can't be said for a `dataclass`.

```python
tsla = DCStockInfo(**json.loads(stock_data)["TSLA"])
name, _, percent_change = tsla
print(f"percent change for {name} stock is {percent_change}")
```

```text
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
  File "/var/folders/9k/rrglbkg540qc7_jb7g6d9l8r0000gn/T/babel-g6I1LO/python-bbTkBK", line 2, in <module>
    name, _, percent_change = tsla
TypeError: cannot unpack non-iterable StockInfo object
```

We can work around this by using the `dataclasses.astuple` function, but it's not as intuitive.

```python
import dataclasses

tsla = DCStockInfo(**json.loads(stock_data)["TSLA"])
print("TSLA values: ", *dataclasses.astuple(tsla), sep=" | ")
name, _, percent_change = dataclasses.astuple(tsla)
print(f"percent change for {name} stock is {percent_change}")
```

```text
TSLA values:  | Tesla, Inc. | 1000.0 | 0.0203
percent change for Tesla, Inc. stock is 0.0203
```

### Serializing to JSON {#serializing-to-json}

Since we're dealing with APIs, it's useful to quickly be able to serialize an object to JSON with the correct types.

```python
tsla = NTStockInfo(**json.loads(stock_data)["TSLA"])

# the _asdict() method converts a NamedTuple to a mapping type
pprint(json.dumps(tsla._asdict()))
```

```text
'{"name": "Tesla, Inc.", "price": 1000.0, "percent_change": 0.0203}'
```

```python
import dataclasses

tsla = DCStockInfo(**json.loads(stock_data)["TSLA"])
pprint(json.dumps(dataclasses.asdict(tsla)))
```

```text
'{"name": "Tesla, Inc.", "price": 1000.0, "percent_change": 0.0203}'
```

Both approaches work equally well in this case.

### Documentation {#documentation}

The `dataclass` implementation is, in my opinion, simpler to implement and has nicer built-in documentation via `help(StockInfo)`.

```nil
Help on class StockInfo in module __main__:

class StockInfo(builtins.object)
 |  StockInfo(name: str, price: float, percent_change: float) -> None
```

Since our `NamedTuple` implementation is a sub-class, we have to scroll down a bit to find the attributes of the class in the `help` output, and the type annotations are hidden away as an `OrderedDict` in the `_fields` attribute.

```nil
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _BaseStockInfo:
 |
 |  name
 |      Alias for field number 0
 |
 |  price
 |      Alias for field number 1
 |
 |  percent_change
 |      Alias for field number 2
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _BaseStockInfo:
 |
 |  __annotations__ = OrderedDict([('name', <class 'str'>), ('price', ... ...
 |
 |  _field_defaults = {}
 |
 |  _field_types = OrderedDict([('name', <class 'str'>),
```
